_out/iam/role_vpc_flow_logs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Role for VPC Flow Logs </title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Role for VPC Flow Logs </h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org329321d">Parameters</a>
<ul>
<li><a href="#orga9ab5da">DeploymentName</a></li>
</ul>
</li>
<li><a href="#org4b44f60">Resources</a>
<ul>
<li><a href="#org25bfe8e">Role</a></li>
<li><a href="#orgb41c0a9">Policy</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<ul class="org-ul">
<li>CloudFormation template: <a href="https://cfclrk.com/cloudformation/iam/role_vpc_flow_logs.yaml">yaml</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">AWSTemplateFormatVersion</span>: 2010-09-09
<span style="color: #dcaeea;">Description</span>: IAM Role for creating VPC Flow Logs
</pre>
</div>

<div id="outline-container-org329321d" class="outline-2">
<h2 id="org329321d"><a href="#org329321d">Parameters</a></h2>
<div class="outline-text-2" id="text-org329321d">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Parameters</span>:
</pre>
</div>

<table id="orgd1a9f7f">


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DeploymentName</td>
<td class="org-left">test</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orga9ab5da" class="outline-3">
<h3 id="orga9ab5da"><a href="#orga9ab5da">DeploymentName</a></h3>
<div class="outline-text-3" id="text-orga9ab5da">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">DeploymentName</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: A name for this deployment
</pre>
</div>

<p>
A <b>deployment</b> is a deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded and confusing term. Use the <code>DeploymentName</code> to indicate which
logical deployment a stack belongs to.
</p>

<p>
If a deployment is completely specified by exactly one CloudFormation template,
the <code>DeploymentName</code> and the <a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/pseudo-parameter-reference.html#cfn-pseudo-param-stackname">AWS::StackName</a> refer to the same things. In that
case, consider not using a <code>DeploymentName</code> parameter.
</p>
</div>
</div>
</div>

<div id="outline-container-org4b44f60" class="outline-2">
<h2 id="org4b44f60"><a href="#org4b44f60">Resources</a></h2>
<div class="outline-text-2" id="text-org4b44f60">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Resources</span>:
</pre>
</div>
</div>

<div id="outline-container-org25bfe8e" class="outline-3">
<h3 id="org25bfe8e"><a href="#org25bfe8e">Role</a></h3>
<div class="outline-text-3" id="text-org25bfe8e">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">VpcFlowLogsRole</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::Role
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">RoleName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-VpcFlowLogs"</span>
      <span style="color: #dcaeea;">AssumeRolePolicyDocument</span>:
        <span style="color: #dcaeea;">Version</span>: 2012-10-17
        <span style="color: #dcaeea;">Statement</span>:
          - <span style="color: #dcaeea;">Effect</span>: Allow
            <span style="color: #dcaeea;">Principal</span>:
              <span style="color: #dcaeea;">Service</span>: vpc-flow-logs.amazonaws.com
            <span style="color: #dcaeea;">Action</span>:
              - sts:AssumeRole
      <span style="color: #dcaeea;">ManagedPolicyArns</span>:
        - <span style="color: #ECBE7B;">!Ref</span> AllowVpcFlowLogs
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb41c0a9" class="outline-3">
<h3 id="orgb41c0a9"><a href="#orgb41c0a9">Policy</a></h3>
<div class="outline-text-3" id="text-orgb41c0a9">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">AllowVpcFlowLogs</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::ManagedPolicy
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">Description</span>: Allow VPC Flow Logs to write logs
      <span style="color: #dcaeea;">ManagedPolicyName</span>: VpcFlowLog
      <span style="color: #dcaeea;">PolicyDocument</span>:
        <span style="color: #dcaeea;">Version</span>: 2012-10-17
        <span style="color: #dcaeea;">Statement</span>:
          - <span style="color: #dcaeea;">Effect</span>: Allow
            <span style="color: #dcaeea;">Action</span>:
              - logs:CreateLogGroup
              - logs:CreateLogStream
              - logs:PutLogEvents
              - logs:DescribeLogGroups
              - logs:DescribeLogStreams
            <span style="color: #dcaeea;">Resource</span>: <span style="color: #98be65;">"*"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
